tutorials/07NonIsothermalMixingElbow/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 60;

boundaryField
{
    wall-4
    {
          
         type           zeroGradient;
    }

    velocity-inlet-5

    {
        type            fixedValue;
	value		uniform 60;
    }

   velocity-inlet-6

   { 
        type            fixedValue;
	value		uniform 70;
    }

    pressure-outlet-7
    {
        type            zeroGradient;
    }


    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
